MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz2051ca9/thirdparty/pic32cz2051ca9/component/adc.h
#define ADC_CHNCFG5_TRGSRC8_Pos               _UINT32_(0)                                          /* (ADC_CHNCFG5) Channel 8 Trigger Source Position */
#define ADC_CHNCFG5_TRGSRC8_Msk               (_UINT32_(0xF) << ADC_CHNCFG5_TRGSRC8_Pos)           /* (ADC_CHNCFG5) Channel 8 Trigger Source Mask */
#define ADC_CHNCFG5_TRGSRC8(value)            (ADC_CHNCFG5_TRGSRC8_Msk & (_UINT32_(value) << ADC_CHNCFG5_TRGSRC8_Pos)) /* Assignment of value for TRGSRC8 in the ADC_CHNCFG5 register */
#define   ADC_CHNCFG5_TRGSRC8_NO_TRIGGER_Val  _UINT32_(0x0)                                        /* (ADC_CHNCFG5) No Trigger (NOP)  */
#define   ADC_CHNCFG5_TRGSRC8_GLOBAL_SOFTWARE_TRIGGER_Val _UINT32_(0x1)                                        /* (ADC_CHNCFG5) Global Software Trigger  */
#define   ADC_CHNCFG5_TRGSRC8_GLOBAL_LEVEL_TRIGGER_Val _UINT32_(0x2)                                        /* (ADC_CHNCFG5) Global Level Software Trigger  */
#define   ADC_CHNCFG5_TRGSRC8_SCAN_TRIGGER_Val _UINT32_(0x3)                                        /* (ADC_CHNCFG5) SCANTRG - Scan Trigger  */
#define   ADC_CHNCFG5_TRGSRC8_SYNC_TRIGGER_Val _UINT32_(0x4)                                        /* (ADC_CHNCFG5) STRIG Synchronous Trigger  */
#define   ADC_CHNCFG5_TRGSRC8_EVENT_USER0_Val _UINT32_(0x5)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 0  */
#define   ADC_CHNCFG5_TRGSRC8_EVENT_USER1_Val _UINT32_(0x6)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 1  */
#define   ADC_CHNCFG5_TRGSRC8_EVENT_USER2_Val _UINT32_(0x7)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 2  */
#define   ADC_CHNCFG5_TRGSRC8_EVENT_USER3_Val _UINT32_(0x8)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 3  */
#define   ADC_CHNCFG5_TRGSRC8_EVENT_USER4_Val _UINT32_(0x9)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 4  */
#define   ADC_CHNCFG5_TRGSRC8_EVENT_USER5_Val _UINT32_(0xA)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 5  */
#define   ADC_CHNCFG5_TRGSRC8_EVENT_USER6_Val _UINT32_(0xB)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 6  */
#define   ADC_CHNCFG5_TRGSRC8_EVENT_USER7_Val _UINT32_(0xC)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 7  */
#define   ADC_CHNCFG5_TRGSRC8_EVENT_USER8_Val _UINT32_(0xD)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 8  */
#define   ADC_CHNCFG5_TRGSRC8_EVENT_USER9_Val _UINT32_(0xE)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 9  */
#define   ADC_CHNCFG5_TRGSRC8_EVENT_USER10_Val _UINT32_(0xF)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 10  */
#define ADC_CHNCFG5_TRGSRC8_NO_TRIGGER        (ADC_CHNCFG5_TRGSRC8_NO_TRIGGER_Val << ADC_CHNCFG5_TRGSRC8_Pos) /* (ADC_CHNCFG5) No Trigger (NOP) Position */
#define ADC_CHNCFG5_TRGSRC8_GLOBAL_SOFTWARE_TRIGGER (ADC_CHNCFG5_TRGSRC8_GLOBAL_SOFTWARE_TRIGGER_Val << ADC_CHNCFG5_TRGSRC8_Pos) /* (ADC_CHNCFG5) Global Software Trigger Position */
#define ADC_CHNCFG5_TRGSRC8_GLOBAL_LEVEL_TRIGGER (ADC_CHNCFG5_TRGSRC8_GLOBAL_LEVEL_TRIGGER_Val << ADC_CHNCFG5_TRGSRC8_Pos) /* (ADC_CHNCFG5) Global Level Software Trigger Position */
#define ADC_CHNCFG5_TRGSRC8_SCAN_TRIGGER      (ADC_CHNCFG5_TRGSRC8_SCAN_TRIGGER_Val << ADC_CHNCFG5_TRGSRC8_Pos) /* (ADC_CHNCFG5) SCANTRG - Scan Trigger Position */
#define ADC_CHNCFG5_TRGSRC8_SYNC_TRIGGER      (ADC_CHNCFG5_TRGSRC8_SYNC_TRIGGER_Val << ADC_CHNCFG5_TRGSRC8_Pos) /* (ADC_CHNCFG5) STRIG Synchronous Trigger Position */
#define ADC_CHNCFG5_TRGSRC8_EVENT_USER0       (ADC_CHNCFG5_TRGSRC8_EVENT_USER0_Val << ADC_CHNCFG5_TRGSRC8_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 0 Position */
#define ADC_CHNCFG5_TRGSRC8_EVENT_USER1       (ADC_CHNCFG5_TRGSRC8_EVENT_USER1_Val << ADC_CHNCFG5_TRGSRC8_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 1 Position */
#define ADC_CHNCFG5_TRGSRC8_EVENT_USER2       (ADC_CHNCFG5_TRGSRC8_EVENT_USER2_Val << ADC_CHNCFG5_TRGSRC8_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 2 Position */
#define ADC_CHNCFG5_TRGSRC8_EVENT_USER3       (ADC_CHNCFG5_TRGSRC8_EVENT_USER3_Val << ADC_CHNCFG5_TRGSRC8_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 3 Position */
#define ADC_CHNCFG5_TRGSRC8_EVENT_USER4       (ADC_CHNCFG5_TRGSRC8_EVENT_USER4_Val << ADC_CHNCFG5_TRGSRC8_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 4 Position */
#define ADC_CHNCFG5_TRGSRC8_EVENT_USER5       (ADC_CHNCFG5_TRGSRC8_EVENT_USER5_Val << ADC_CHNCFG5_TRGSRC8_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 5 Position */
#define ADC_CHNCFG5_TRGSRC8_EVENT_USER6       (ADC_CHNCFG5_TRGSRC8_EVENT_USER6_Val << ADC_CHNCFG5_TRGSRC8_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 6 Position */
#define ADC_CHNCFG5_TRGSRC8_EVENT_USER7       (ADC_CHNCFG5_TRGSRC8_EVENT_USER7_Val << ADC_CHNCFG5_TRGSRC8_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 7 Position */
#define ADC_CHNCFG5_TRGSRC8_EVENT_USER8       (ADC_CHNCFG5_TRGSRC8_EVENT_USER8_Val << ADC_CHNCFG5_TRGSRC8_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 8 Position */
#define ADC_CHNCFG5_TRGSRC8_EVENT_USER9       (ADC_CHNCFG5_TRGSRC8_EVENT_USER9_Val << ADC_CHNCFG5_TRGSRC8_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 9 Position */
#define ADC_CHNCFG5_TRGSRC8_EVENT_USER10      (ADC_CHNCFG5_TRGSRC8_EVENT_USER10_Val << ADC_CHNCFG5_TRGSRC8_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 10 Position */
#define ADC_CHNCFG5_TRGSRC9_Pos               _UINT32_(4)                                          /* (ADC_CHNCFG5) Channel 9 Trigger Source Position */
#define ADC_CHNCFG5_TRGSRC9_Msk               (_UINT32_(0xF) << ADC_CHNCFG5_TRGSRC9_Pos)           /* (ADC_CHNCFG5) Channel 9 Trigger Source Mask */
#define ADC_CHNCFG5_TRGSRC9(value)            (ADC_CHNCFG5_TRGSRC9_Msk & (_UINT32_(value) << ADC_CHNCFG5_TRGSRC9_Pos)) /* Assignment of value for TRGSRC9 in the ADC_CHNCFG5 register */
#define   ADC_CHNCFG5_TRGSRC9_NO_TRIGGER_Val  _UINT32_(0x0)                                        /* (ADC_CHNCFG5) No Trigger (NOP)  */
#define   ADC_CHNCFG5_TRGSRC9_GLOBAL_SOFTWARE_TRIGGER_Val _UINT32_(0x1)                                        /* (ADC_CHNCFG5) Global Software Trigger  */
#define   ADC_CHNCFG5_TRGSRC9_GLOBAL_LEVEL_TRIGGER_Val _UINT32_(0x2)                                        /* (ADC_CHNCFG5) Global Level Software Trigger  */
#define   ADC_CHNCFG5_TRGSRC9_SCAN_TRIGGER_Val _UINT32_(0x3)                                        /* (ADC_CHNCFG5) SCANTRG - Scan Trigger  */
#define   ADC_CHNCFG5_TRGSRC9_SYNC_TRIGGER_Val _UINT32_(0x4)                                        /* (ADC_CHNCFG5) STRIG Synchronous Trigger  */
#define   ADC_CHNCFG5_TRGSRC9_EVENT_USER0_Val _UINT32_(0x5)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 0  */
#define   ADC_CHNCFG5_TRGSRC9_EVENT_USER1_Val _UINT32_(0x6)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 1  */
#define   ADC_CHNCFG5_TRGSRC9_EVENT_USER2_Val _UINT32_(0x7)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 2  */
#define   ADC_CHNCFG5_TRGSRC9_EVENT_USER3_Val _UINT32_(0x8)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 3  */
#define   ADC_CHNCFG5_TRGSRC9_EVENT_USER4_Val _UINT32_(0x9)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 4  */
#define   ADC_CHNCFG5_TRGSRC9_EVENT_USER5_Val _UINT32_(0xA)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 5  */
#define   ADC_CHNCFG5_TRGSRC9_EVENT_USER6_Val _UINT32_(0xB)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 6  */
#define   ADC_CHNCFG5_TRGSRC9_EVENT_USER7_Val _UINT32_(0xC)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 7  */
#define   ADC_CHNCFG5_TRGSRC9_EVENT_USER8_Val _UINT32_(0xD)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 8  */
#define   ADC_CHNCFG5_TRGSRC9_EVENT_USER9_Val _UINT32_(0xE)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 9  */
#define   ADC_CHNCFG5_TRGSRC9_EVENT_USER10_Val _UINT32_(0xF)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 10  */
#define ADC_CHNCFG5_TRGSRC9_NO_TRIGGER        (ADC_CHNCFG5_TRGSRC9_NO_TRIGGER_Val << ADC_CHNCFG5_TRGSRC9_Pos) /* (ADC_CHNCFG5) No Trigger (NOP) Position */
#define ADC_CHNCFG5_TRGSRC9_GLOBAL_SOFTWARE_TRIGGER (ADC_CHNCFG5_TRGSRC9_GLOBAL_SOFTWARE_TRIGGER_Val << ADC_CHNCFG5_TRGSRC9_Pos) /* (ADC_CHNCFG5) Global Software Trigger Position */
#define ADC_CHNCFG5_TRGSRC9_GLOBAL_LEVEL_TRIGGER (ADC_CHNCFG5_TRGSRC9_GLOBAL_LEVEL_TRIGGER_Val << ADC_CHNCFG5_TRGSRC9_Pos) /* (ADC_CHNCFG5) Global Level Software Trigger Position */
#define ADC_CHNCFG5_TRGSRC9_SCAN_TRIGGER      (ADC_CHNCFG5_TRGSRC9_SCAN_TRIGGER_Val << ADC_CHNCFG5_TRGSRC9_Pos) /* (ADC_CHNCFG5) SCANTRG - Scan Trigger Position */
#define ADC_CHNCFG5_TRGSRC9_SYNC_TRIGGER      (ADC_CHNCFG5_TRGSRC9_SYNC_TRIGGER_Val << ADC_CHNCFG5_TRGSRC9_Pos) /* (ADC_CHNCFG5) STRIG Synchronous Trigger Position */
#define ADC_CHNCFG5_TRGSRC9_EVENT_USER0       (ADC_CHNCFG5_TRGSRC9_EVENT_USER0_Val << ADC_CHNCFG5_TRGSRC9_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 0 Position */
#define ADC_CHNCFG5_TRGSRC9_EVENT_USER1       (ADC_CHNCFG5_TRGSRC9_EVENT_USER1_Val << ADC_CHNCFG5_TRGSRC9_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 1 Position */
#define ADC_CHNCFG5_TRGSRC9_EVENT_USER2       (ADC_CHNCFG5_TRGSRC9_EVENT_USER2_Val << ADC_CHNCFG5_TRGSRC9_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 2 Position */
#define ADC_CHNCFG5_TRGSRC9_EVENT_USER3       (ADC_CHNCFG5_TRGSRC9_EVENT_USER3_Val << ADC_CHNCFG5_TRGSRC9_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 3 Position */
#define ADC_CHNCFG5_TRGSRC9_EVENT_USER4       (ADC_CHNCFG5_TRGSRC9_EVENT_USER4_Val << ADC_CHNCFG5_TRGSRC9_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 4 Position */
#define ADC_CHNCFG5_TRGSRC9_EVENT_USER5       (ADC_CHNCFG5_TRGSRC9_EVENT_USER5_Val << ADC_CHNCFG5_TRGSRC9_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 5 Position */
#define ADC_CHNCFG5_TRGSRC9_EVENT_USER6       (ADC_CHNCFG5_TRGSRC9_EVENT_USER6_Val << ADC_CHNCFG5_TRGSRC9_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 6 Position */
#define ADC_CHNCFG5_TRGSRC9_EVENT_USER7       (ADC_CHNCFG5_TRGSRC9_EVENT_USER7_Val << ADC_CHNCFG5_TRGSRC9_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 7 Position */
#define ADC_CHNCFG5_TRGSRC9_EVENT_USER8       (ADC_CHNCFG5_TRGSRC9_EVENT_USER8_Val << ADC_CHNCFG5_TRGSRC9_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 8 Position */
#define ADC_CHNCFG5_TRGSRC9_EVENT_USER9       (ADC_CHNCFG5_TRGSRC9_EVENT_USER9_Val << ADC_CHNCFG5_TRGSRC9_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 9 Position */
#define ADC_CHNCFG5_TRGSRC9_EVENT_USER10      (ADC_CHNCFG5_TRGSRC9_EVENT_USER10_Val << ADC_CHNCFG5_TRGSRC9_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 10 Position */
#define ADC_CHNCFG5_TRGSRC10_Pos              _UINT32_(8)                                          /* (ADC_CHNCFG5) Channel 10 Trigger Source Position */
#define ADC_CHNCFG5_TRGSRC10_Msk              (_UINT32_(0xF) << ADC_CHNCFG5_TRGSRC10_Pos)          /* (ADC_CHNCFG5) Channel 10 Trigger Source Mask */
#define ADC_CHNCFG5_TRGSRC10(value)           (ADC_CHNCFG5_TRGSRC10_Msk & (_UINT32_(value) << ADC_CHNCFG5_TRGSRC10_Pos)) /* Assignment of value for TRGSRC10 in the ADC_CHNCFG5 register */
#define   ADC_CHNCFG5_TRGSRC10_NO_TRIGGER_Val _UINT32_(0x0)                                        /* (ADC_CHNCFG5) No Trigger (NOP)  */
#define   ADC_CHNCFG5_TRGSRC10_GLOBAL_SOFTWARE_TRIGGER_Val _UINT32_(0x1)                                        /* (ADC_CHNCFG5) Global Software Trigger  */
#define   ADC_CHNCFG5_TRGSRC10_GLOBAL_LEVEL_TRIGGER_Val _UINT32_(0x2)                                        /* (ADC_CHNCFG5) Global Level Software Trigger  */
#define   ADC_CHNCFG5_TRGSRC10_SCAN_TRIGGER_Val _UINT32_(0x3)                                        /* (ADC_CHNCFG5) SCANTRG - Scan Trigger  */
#define   ADC_CHNCFG5_TRGSRC10_SYNC_TRIGGER_Val _UINT32_(0x4)                                        /* (ADC_CHNCFG5) STRIG Synchronous Trigger  */
#define   ADC_CHNCFG5_TRGSRC10_EVENT_USER0_Val _UINT32_(0x5)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 0  */
#define   ADC_CHNCFG5_TRGSRC10_EVENT_USER1_Val _UINT32_(0x6)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 1  */
#define   ADC_CHNCFG5_TRGSRC10_EVENT_USER2_Val _UINT32_(0x7)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 2  */
#define   ADC_CHNCFG5_TRGSRC10_EVENT_USER3_Val _UINT32_(0x8)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 3  */
#define   ADC_CHNCFG5_TRGSRC10_EVENT_USER4_Val _UINT32_(0x9)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 4  */
#define   ADC_CHNCFG5_TRGSRC10_EVENT_USER5_Val _UINT32_(0xA)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 5  */
#define   ADC_CHNCFG5_TRGSRC10_EVENT_USER6_Val _UINT32_(0xB)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 6  */
#define   ADC_CHNCFG5_TRGSRC10_EVENT_USER7_Val _UINT32_(0xC)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 7  */
#define   ADC_CHNCFG5_TRGSRC10_EVENT_USER8_Val _UINT32_(0xD)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 8  */
#define   ADC_CHNCFG5_TRGSRC10_EVENT_USER9_Val _UINT32_(0xE)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 9  */
#define   ADC_CHNCFG5_TRGSRC10_EVENT_USER10_Val _UINT32_(0xF)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 10  */
#define ADC_CHNCFG5_TRGSRC10_NO_TRIGGER       (ADC_CHNCFG5_TRGSRC10_NO_TRIGGER_Val << ADC_CHNCFG5_TRGSRC10_Pos) /* (ADC_CHNCFG5) No Trigger (NOP) Position */
#define ADC_CHNCFG5_TRGSRC10_GLOBAL_SOFTWARE_TRIGGER (ADC_CHNCFG5_TRGSRC10_GLOBAL_SOFTWARE_TRIGGER_Val << ADC_CHNCFG5_TRGSRC10_Pos) /* (ADC_CHNCFG5) Global Software Trigger Position */
#define ADC_CHNCFG5_TRGSRC10_GLOBAL_LEVEL_TRIGGER (ADC_CHNCFG5_TRGSRC10_GLOBAL_LEVEL_TRIGGER_Val << ADC_CHNCFG5_TRGSRC10_Pos) /* (ADC_CHNCFG5) Global Level Software Trigger Position */
#define ADC_CHNCFG5_TRGSRC10_SCAN_TRIGGER     (ADC_CHNCFG5_TRGSRC10_SCAN_TRIGGER_Val << ADC_CHNCFG5_TRGSRC10_Pos) /* (ADC_CHNCFG5) SCANTRG - Scan Trigger Position */
#define ADC_CHNCFG5_TRGSRC10_SYNC_TRIGGER     (ADC_CHNCFG5_TRGSRC10_SYNC_TRIGGER_Val << ADC_CHNCFG5_TRGSRC10_Pos) /* (ADC_CHNCFG5) STRIG Synchronous Trigger Position */
#define ADC_CHNCFG5_TRGSRC10_EVENT_USER0      (ADC_CHNCFG5_TRGSRC10_EVENT_USER0_Val << ADC_CHNCFG5_TRGSRC10_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 0 Position */
#define ADC_CHNCFG5_TRGSRC10_EVENT_USER1      (ADC_CHNCFG5_TRGSRC10_EVENT_USER1_Val << ADC_CHNCFG5_TRGSRC10_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 1 Position */
#define ADC_CHNCFG5_TRGSRC10_EVENT_USER2      (ADC_CHNCFG5_TRGSRC10_EVENT_USER2_Val << ADC_CHNCFG5_TRGSRC10_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 2 Position */
#define ADC_CHNCFG5_TRGSRC10_EVENT_USER3      (ADC_CHNCFG5_TRGSRC10_EVENT_USER3_Val << ADC_CHNCFG5_TRGSRC10_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 3 Position */
#define ADC_CHNCFG5_TRGSRC10_EVENT_USER4      (ADC_CHNCFG5_TRGSRC10_EVENT_USER4_Val << ADC_CHNCFG5_TRGSRC10_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 4 Position */
#define ADC_CHNCFG5_TRGSRC10_EVENT_USER5      (ADC_CHNCFG5_TRGSRC10_EVENT_USER5_Val << ADC_CHNCFG5_TRGSRC10_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 5 Position */
#define ADC_CHNCFG5_TRGSRC10_EVENT_USER6      (ADC_CHNCFG5_TRGSRC10_EVENT_USER6_Val << ADC_CHNCFG5_TRGSRC10_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 6 Position */
#define ADC_CHNCFG5_TRGSRC10_EVENT_USER7      (ADC_CHNCFG5_TRGSRC10_EVENT_USER7_Val << ADC_CHNCFG5_TRGSRC10_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 7 Position */
#define ADC_CHNCFG5_TRGSRC10_EVENT_USER8      (ADC_CHNCFG5_TRGSRC10_EVENT_USER8_Val << ADC_CHNCFG5_TRGSRC10_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 8 Position */
#define ADC_CHNCFG5_TRGSRC10_EVENT_USER9      (ADC_CHNCFG5_TRGSRC10_EVENT_USER9_Val << ADC_CHNCFG5_TRGSRC10_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 9 Position */
#define ADC_CHNCFG5_TRGSRC10_EVENT_USER10     (ADC_CHNCFG5_TRGSRC10_EVENT_USER10_Val << ADC_CHNCFG5_TRGSRC10_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 10 Position */
#define ADC_CHNCFG5_TRGSRC11_Pos              _UINT32_(12)                                         /* (ADC_CHNCFG5) Channel 11 Trigger Source Position */
#define ADC_CHNCFG5_TRGSRC11_Msk              (_UINT32_(0xF) << ADC_CHNCFG5_TRGSRC11_Pos)          /* (ADC_CHNCFG5) Channel 11 Trigger Source Mask */
#define ADC_CHNCFG5_TRGSRC11(value)           (ADC_CHNCFG5_TRGSRC11_Msk & (_UINT32_(value) << ADC_CHNCFG5_TRGSRC11_Pos)) /* Assignment of value for TRGSRC11 in the ADC_CHNCFG5 register */
#define   ADC_CHNCFG5_TRGSRC11_NO_TRIGGER_Val _UINT32_(0x0)                                        /* (ADC_CHNCFG5) No Trigger (NOP)  */
#define   ADC_CHNCFG5_TRGSRC11_GLOBAL_SOFTWARE_TRIGGER_Val _UINT32_(0x1)                                        /* (ADC_CHNCFG5) Global Software Trigger  */
#define   ADC_CHNCFG5_TRGSRC11_GLOBAL_LEVEL_TRIGGER_Val _UINT32_(0x2)                                        /* (ADC_CHNCFG5) Global Level Software Trigger  */
#define   ADC_CHNCFG5_TRGSRC11_SCAN_TRIGGER_Val _UINT32_(0x3)                                        /* (ADC_CHNCFG5) SCANTRG - Scan Trigger  */
#define   ADC_CHNCFG5_TRGSRC11_SYNC_TRIGGER_Val _UINT32_(0x4)                                        /* (ADC_CHNCFG5) STRIG Synchronous Trigger  */
#define   ADC_CHNCFG5_TRGSRC11_EVENT_USER0_Val _UINT32_(0x5)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 0  */
#define   ADC_CHNCFG5_TRGSRC11_EVENT_USER1_Val _UINT32_(0x6)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 1  */
#define   ADC_CHNCFG5_TRGSRC11_EVENT_USER2_Val _UINT32_(0x7)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 2  */
#define   ADC_CHNCFG5_TRGSRC11_EVENT_USER3_Val _UINT32_(0x8)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 3  */
#define   ADC_CHNCFG5_TRGSRC11_EVENT_USER4_Val _UINT32_(0x9)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 4  */
#define   ADC_CHNCFG5_TRGSRC11_EVENT_USER5_Val _UINT32_(0xA)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 5  */
#define   ADC_CHNCFG5_TRGSRC11_EVENT_USER6_Val _UINT32_(0xB)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 6  */
#define   ADC_CHNCFG5_TRGSRC11_EVENT_USER7_Val _UINT32_(0xC)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 7  */
#define   ADC_CHNCFG5_TRGSRC11_EVENT_USER8_Val _UINT32_(0xD)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 8  */
#define   ADC_CHNCFG5_TRGSRC11_EVENT_USER9_Val _UINT32_(0xE)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 9  */
#define   ADC_CHNCFG5_TRGSRC11_EVENT_USER10_Val _UINT32_(0xF)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 10  */
#define ADC_CHNCFG5_TRGSRC11_NO_TRIGGER       (ADC_CHNCFG5_TRGSRC11_NO_TRIGGER_Val << ADC_CHNCFG5_TRGSRC11_Pos) /* (ADC_CHNCFG5) No Trigger (NOP) Position */
#define ADC_CHNCFG5_TRGSRC11_GLOBAL_SOFTWARE_TRIGGER (ADC_CHNCFG5_TRGSRC11_GLOBAL_SOFTWARE_TRIGGER_Val << ADC_CHNCFG5_TRGSRC11_Pos) /* (ADC_CHNCFG5) Global Software Trigger Position */
#define ADC_CHNCFG5_TRGSRC11_GLOBAL_LEVEL_TRIGGER (ADC_CHNCFG5_TRGSRC11_GLOBAL_LEVEL_TRIGGER_Val << ADC_CHNCFG5_TRGSRC11_Pos) /* (ADC_CHNCFG5) Global Level Software Trigger Position */
#define ADC_CHNCFG5_TRGSRC11_SCAN_TRIGGER     (ADC_CHNCFG5_TRGSRC11_SCAN_TRIGGER_Val << ADC_CHNCFG5_TRGSRC11_Pos) /* (ADC_CHNCFG5) SCANTRG - Scan Trigger Position */
#define ADC_CHNCFG5_TRGSRC11_SYNC_TRIGGER     (ADC_CHNCFG5_TRGSRC11_SYNC_TRIGGER_Val << ADC_CHNCFG5_TRGSRC11_Pos) /* (ADC_CHNCFG5) STRIG Synchronous Trigger Position */
#define ADC_CHNCFG5_TRGSRC11_EVENT_USER0      (ADC_CHNCFG5_TRGSRC11_EVENT_USER0_Val << ADC_CHNCFG5_TRGSRC11_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 0 Position */
#define ADC_CHNCFG5_TRGSRC11_EVENT_USER1      (ADC_CHNCFG5_TRGSRC11_EVENT_USER1_Val << ADC_CHNCFG5_TRGSRC11_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 1 Position */
#define ADC_CHNCFG5_TRGSRC11_EVENT_USER2      (ADC_CHNCFG5_TRGSRC11_EVENT_USER2_Val << ADC_CHNCFG5_TRGSRC11_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 2 Position */
#define ADC_CHNCFG5_TRGSRC11_EVENT_USER3      (ADC_CHNCFG5_TRGSRC11_EVENT_USER3_Val << ADC_CHNCFG5_TRGSRC11_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 3 Position */
#define ADC_CHNCFG5_TRGSRC11_EVENT_USER4      (ADC_CHNCFG5_TRGSRC11_EVENT_USER4_Val << ADC_CHNCFG5_TRGSRC11_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 4 Position */
#define ADC_CHNCFG5_TRGSRC11_EVENT_USER5      (ADC_CHNCFG5_TRGSRC11_EVENT_USER5_Val << ADC_CHNCFG5_TRGSRC11_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 5 Position */
#define ADC_CHNCFG5_TRGSRC11_EVENT_USER6      (ADC_CHNCFG5_TRGSRC11_EVENT_USER6_Val << ADC_CHNCFG5_TRGSRC11_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 6 Position */
#define ADC_CHNCFG5_TRGSRC11_EVENT_USER7      (ADC_CHNCFG5_TRGSRC11_EVENT_USER7_Val << ADC_CHNCFG5_TRGSRC11_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 7 Position */
#define ADC_CHNCFG5_TRGSRC11_EVENT_USER8      (ADC_CHNCFG5_TRGSRC11_EVENT_USER8_Val << ADC_CHNCFG5_TRGSRC11_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 8 Position */
#define ADC_CHNCFG5_TRGSRC11_EVENT_USER9      (ADC_CHNCFG5_TRGSRC11_EVENT_USER9_Val << ADC_CHNCFG5_TRGSRC11_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 9 Position */
#define ADC_CHNCFG5_TRGSRC11_EVENT_USER10     (ADC_CHNCFG5_TRGSRC11_EVENT_USER10_Val << ADC_CHNCFG5_TRGSRC11_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 10 Position */
#define ADC_CHNCFG5_TRGSRC12_Pos              _UINT32_(16)                                         /* (ADC_CHNCFG5) Channel 12 Trigger Source Position */
#define ADC_CHNCFG5_TRGSRC12_Msk              (_UINT32_(0xF) << ADC_CHNCFG5_TRGSRC12_Pos)          /* (ADC_CHNCFG5) Channel 12 Trigger Source Mask */
#define ADC_CHNCFG5_TRGSRC12(value)           (ADC_CHNCFG5_TRGSRC12_Msk & (_UINT32_(value) << ADC_CHNCFG5_TRGSRC12_Pos)) /* Assignment of value for TRGSRC12 in the ADC_CHNCFG5 register */
#define   ADC_CHNCFG5_TRGSRC12_NO_TRIGGER_Val _UINT32_(0x0)                                        /* (ADC_CHNCFG5) No Trigger (NOP)  */
#define   ADC_CHNCFG5_TRGSRC12_GLOBAL_SOFTWARE_TRIGGER_Val _UINT32_(0x1)                                        /* (ADC_CHNCFG5) Global Software Trigger  */
#define   ADC_CHNCFG5_TRGSRC12_GLOBAL_LEVEL_TRIGGER_Val _UINT32_(0x2)                                        /* (ADC_CHNCFG5) Global Level Software Trigger  */
#define   ADC_CHNCFG5_TRGSRC12_SCAN_TRIGGER_Val _UINT32_(0x3)                                        /* (ADC_CHNCFG5) SCANTRG - Scan Trigger  */
#define   ADC_CHNCFG5_TRGSRC12_SYNC_TRIGGER_Val _UINT32_(0x4)                                        /* (ADC_CHNCFG5) STRIG Synchronous Trigger  */
#define   ADC_CHNCFG5_TRGSRC12_EVENT_USER0_Val _UINT32_(0x5)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 0  */
#define   ADC_CHNCFG5_TRGSRC12_EVENT_USER1_Val _UINT32_(0x6)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 1  */
#define   ADC_CHNCFG5_TRGSRC12_EVENT_USER2_Val _UINT32_(0x7)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 2  */
#define   ADC_CHNCFG5_TRGSRC12_EVENT_USER3_Val _UINT32_(0x8)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 3  */
